'''
2025.04.18 금
'''

print()
print()
print("------------------------")
print("--- 주피터 노트북")
print("------------------------")
print()

'''
[아나콘다]

- 데이터 과학, 머신러닝, 인공지능 분야 등에서 사용한다.
- conda : 가상환경과 패키지를 관리하는 도구이다.

[Jupyter NoteBook] 

- 웹브라우저에서 파이썬 코드를 실행하고 결과를 시각적으로 볼 수 있게 해주는 도구이다.

[주피터 노트북] 

-  내 컴퓨터에서 파이썬 공부를 하거나 실험할 때 좋다.
    - 사용목적: 반복적 작업, 프로젝트 코드 작성에 적합

[구글 코랩] 

- 인터넷만 있으면 어디서든 gpu 까지 써서 실습할 수 있다.
    - 사용목적: 빠른 실험, 강의, 튜토리얼에 적합
'''

print()
print()
print("------------------------ 끝")
print()
